#include<stdio.h>

int main()
{
    /*
    double i;
    for(i = 0; i < 10.1; i += 0.1)
        printf("%.16f\n",i);
    return 0;
    */
    //浮点数经典坑，浮点数无法精确表示0.1，0.1在二进制里是个无限循环小数，只能被近似存储
    //每次+=0.1的时候累计的误差会越来越大，到100次的时候i可能是类似10.00000000000000000000002或者9.9999999999999998这样的值
    //事实果真如此 9.9999999999999805


    //我的这份代码是对的！ 但是还有一种叫位运算的算法更简洁，并且没有嵌套循环
    int a, b, c;

    for(int i = 100; i < 334; i++)
    {
        int num[10] = {0};

        a = i;
        b = 2 * i;
        c = 3 * i;

        //记录每一个数字出现的次数
        num[a/100]++;
        num[(a % 100)/10]++;
        num[a % 10]++;

        num[b/100]++;
        num[(b % 100)/10]++;
        num[b % 10] ++;

        num[c/100]++;
        num[(c % 100)/10]++;
        num[c % 10]++;

        //首先要求0没有出现过
        if(num[0] == 0)
        {
            int temp = 0;
            for(int j = 1; j <= 9; j++)//循环内部套循环就不要再用相同的变量了
            {
                if(num[j] == 1)
                    temp++;
            } 
            if(temp == 9) printf("%d %d %d\n", a, b, c);
        }
    }
    return 0;
}